class DirectionRoutesPoints():
    direction_routes_points = {
        "Военвед - Центр": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.257079%2C39.643848~47.262600%2C39.666027~47.250889%2C39.695726~47.236697%2C39.699607~47.222958%2C39.706222~47.222958%2C39.706222~47.220878%2C39.706937~47.216294%2C39.709865&rtt=auto",
                },
                "points": {
                    0: "Таганрогская улица, 124Б(Остановка ЖСК)",
                    1: "Таганрогская улица, 98Б(Остановка Улица Оганова)",
                    2: "улица Шеболдаева, 23А(Остановка Улица Цезаря Куникова)",
                    3: "улица Дранко, 114/101(Остановка Комсомольская площадь)",
                    4: "Красноармейская улица, 122/57(Остановка Улица Максима Горького)",
                    5: "Пушкинская улица, 48/41",
                    6: "Будённовский проспект, 25(Остановка Большая Садовая улица / Консерватория)",
                    7: "Будённовский проспект, 12литА5(Остановка Центральный рынок)"
                }
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.257079%2C39.643848~47.262601%2C39.666028~47.250889%2C39.695726~47.249366%2C39.710494~47.239407%2C39.712956~47.228975%2C39.715498~47.222555%2C39.717995~47.216294%2C39.709865&rtt=auto",
                },
                "points": {
                    0: "Таганрогская улица, 124Б(Остановка ЖСК)",
                    1: "Таганрогская улица, 98Б(Остановка Улица Оганова)",
                    2: "улица Шеболдаева, 23А(Остановка Улица Цезаря Куникова)",
                    3: "проспект Ленина, 99(Остановка Площадь Ленина)",
                    4: "проспект Михаила Нагибина, 5(Остановка ДГТУ)",
                    5: "Ворошиловский проспект, 87Б(Остановка Ворошиловский проспект)",
                    6: "Большая Садовая улица, 69/47(Останвока Большая Садовая улица)",
                    7: "Будённовский проспект, 12литА5(Остановка Центральный рынок)",
                }
            }
        },
        "Суворовский - Центр": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.320850%2C39.683641~47.292991%2C39.660988~47.263806%2C39.666162~47.261843%2C39.683796~47.250889%2C39.695726~47.236697%2C39.699607~47.225976%2C39.704646~47.222904%2C39.705742~47.220878%2C39.706937~47.216294%2C39.709865&rtt=auto",
                },
                "points": {
                    0: "переулок Белоусова(остановка Подстанция СМП)",
                    1: "Особенная улица, 154(Остановка С/т Вираж)",
                    2: "улица Оганова, 1(Остановка Кафе Полет)",
                    3: "Дачная улица, 2/1В(Остановка Улица Вавилова)",
                    4: "улица Шеболдаева, 23А(Остановка Улица Цезаря Куникова)",
                    5: "улица Дранко, 114/101(остановка Комсомольская площадь)",
                    6: "Красноармейская улица, 122/57(Остановка Улица Максима Горького)",
                    7: "Пушкинская улица, 48/41",
                    8: "Будённовский проспект, 25(остановка Будённовский проспект)",
                    9: "Будённовский проспект, 12литА5(Остановка Центральный рынок)",
                }
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.320850%2C39.683641~47.292991%2C39.660988~47.263806%2C39.666162~47.261843%2C39.683796~47.250889%2C39.695726~47.249366%2C39.710494~47.239407%2C39.712956~47.228975%2C39.715498~47.222555%2C39.717995~47.216294%2C39.709865&rtt=auto",
                },
                "points": {
                    0: "переулок Белоусова(остановка Подстанция СМП)",
                    1: "Особенная улица, 154(Остановка С/т Вираж)",
                    2: "Улица Вавилова, 67Д(Остановка Изыскательский переулок)",
                    3: "Дачная улица, 2/1В(Остановка Улица Вавилова)",
                    4: "Улица Шеболдаева, 23А(Остановка Улица Цезаря Куникова)",
                    5: "Проспект Ленина, 99(Остановка Площадь Ленина)",
                    6: "Проспект Михаила Нагибина, 5(Остановка ДГТУ)",
                    7: "Ворошиловский проспект, 87Б(остановка Ворошиловский проспект)",
                    8: "Большая Садовая улица, 69/47(остановка Большая Садовая улица)",
                    9: "Будённовский проспект, 12литА5(Остановка Центральный рынок)",
                }
            },
        },
        "Северный - Центр": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.288774%2C39.710063~47.216824%2C39.712173&rtt=mt",
                },
                "points": {
                    0: "Проспект Космонавтов, 19А ( ост. Бульвар Комарова)",
                    1: "Проспект Космонавтов, 7А ( ост. Северный рынок)",
                    2: "Проспект Михаила Нагибина, 32 ( ост. ТЦ Горизонт)",
                    3: "Проспект Михаила Нагибина, 19/1 ( Площадь Ленина)",
                    4: "Проспект Михаила Нагибина, 3А ( ост. ДГТУ)",
                    5: "Ворошиловский проспект, 87Б ( ост. Ворошиловский проспект)",
                    6: "Ворошиловский проспект, 47 ( ост. Большая Садовая улица)",
                    7: "Темерницкая улица, 46 ( ост. Центральный рынок)",
                }
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.295270%2C39.704163~47.282697%2C39.688740~47.272691%2C39.685421~47.265277%2C39.682362~47.259666%2C39.689535~47.248769%2C39.696880~47.236870%2C39.699895~47.225580%2C39.704996~47.219519%2C39.707751&rtt=auto",
                },
                "points": {
                    0: "Площадь Королёва, 21В/32В ( ост. Площадь Королёва)",
                    1: "Проспект Королёва, 1/8 ( ост. Проспект Королёва, 4)",
                    2: "Арсенальная улица, 3 ( ост. Неклиновская улица)",
                    3: "Улица Вавилова, 47 ( ост. Иловайская улица)",
                    4: "Улица Шеболдаева, 15 ( ост. Улица Шеболдаева / РГУПС)",
                    5: "Стадионная улица, 17 ( ост. Комсомольский парк)",
                    6: "Будённовский проспект, 51 ( ост. Улица Максима Горького)",
                    7: "Будённовский проспект, 21/50 ( ост. Большая Садовая улица / Консерватория)",
                    8: "Московская улица, 56 ( ост. Центральный рынок)",
                }
            }
        },
        "Сельмаш - Центр": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.249837%2C39.764537~47.216824%2C39.712173&rtt=mt",
                },
                "points": {
                    0: "Улица 1-й Конной Армии, 8 ( остановка ДК Ростсельмаш)",
                    1: "Улица 20-я Линия, 66 ( остановка Проспект Шолохова)",
                    2: "Улица 20-я Линия, 2 ( ост. Площадь Карла Маркса)",
                    3: "1-я Майская улица, 63/7 ( ост. 2-я линия)",
                    4: "Театральная площадь, 1 (ост. Театральная площадь)",
                    5: "Большая Садовая улица, 103/51 (ост. Университетский переулок)",
                    6: "Переулок Семашко, 42/49 (ост. Переулок Семашко)",
                }
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.249837%2C39.764537&rtt=auto",
                },
                "points": {
                    0: "Улица 1-й Конной Армии, 15Б ( ост. ДК Ростсельмаш)",
                    1: "Проспект Шолохова, 27/82 ( ост. Проспект Шолохова)",
                    2: "Улица Ченцова, 9к1 ( ост. Улица Каяни)",
                    3: "Улица Максима Горького, 227 (ост. Кировский проспект)",
                    4: "Проспект Богатяновский Спуск, 18 ( ост. Богатяновский спуск )",
                    5: "Береговая улица, 39 ( ост. Береговая улица)",
                    6: "Будённовский проспект, 10/5 (ост. Центральный рынок / Тургеневская улица)",
                }
            },
            3: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.249837%2C39.764537&rtt=auto",
                },
                "points": {
                    0: "Металлургическая улица, 112/64 ( ост. Улица Селиванова)",
                    1: "Улица 14-я Линия, 82/27 ( ост. 14-я линия)",
                    2: "Проспект Шолохова, 1 (ост. Площадь Энергетиков)",
                    3: "Красноармейская улица, 95 ( ост. Проспект Чехова)",
                    4: "Красноармейская улица, 43А ( ост. Переулок Семашко)",
                    5: "Будённовский проспект, 32 ( ост. Большая Садовая улица)",
                    6: "Тургеневская улица, 26/5 ( ост. Центральный рынок / Тургеневская улица)",
                }
            }
        },
        "Западный - Центр": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.212218%2C39.634146~47.216824%2C39.712173&rtt=mt",
                },
                "points": {
                    0: "Проспект Стачки(Школа No 92)",
                    1: "Проспект Стачки(Остановка Площадь Тружеников)",
                    2: "Проспект Стачки(остановка Международная улица)",
                    3: "Проспект Стачки(остановка Площадь Дружинников)",
                    4: "Проспект Стачки(Остановка Переходной мост)",
                    5: "Московская улица(Остановка Площадь 5-го Донского корпуса)",
                    6: "Московская улица(остановка Центральный рынок)",
                }
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.212218%2C39.634146~47.216824%2C39.712173&rtt=auto",
                },
                "points": {
                    0: "Проспект Стачки(Школа No 92)",
                    1: "Проспект Стачки(Остановка Площадь Тружеников)",
                    2: "Портовая улица(Остановка Переулок Деревянко)",
                    3: "Портовая улица(Остановка Переулок Деревянко)",
                    4: "Портовая улица(Остановка Портовая улица, 43-45)",
                    5: "Улица Станиславского(Остановка Площадь 5-го Донского корпуса)",
                    6: "Будённовский проспект(остановка Центральный рынок / Тургеневская улица)",
                }
            },
        },
        "Центр - Военвед": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216294%2C39.709865~47.221964%2C39.719056~47.251663%2C39.698113~47.265218%2C39.683096~47.263268%2C39.665408~47.258363%2C39.645052&rtt=auto",
                },
                "points": {
                    0: "Будённовский проспект, 12литА5(Остановка Центральный рынок)",
                    1: "Площадь Советов(Остановка Площадь Советов)",
                    2: "Лермонтовская улица, 159/56 (Остановка Лермонтовская улица)",
                    3: "площадь Ростовского Стрелкового Полка Народного Ополчения, 2(остановка Улица Ларина / РГУПС)",
                    4: "улица Вавилова, 46(Остановка Иловайская улица)",
                    5: "Таганрогская улица, 133/1(Остановка Улица Оганова)",
                    6: "Таганрогская улица, 167(остановка Стройгородок)",
                }
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216294%2C39.709865~47.220640%2C39.707808~47.229819%2C39.703712~47.250999%2C39.698376~47.265218%2C39.683096~47.263268%2C39.665408~47.258363%2C39.645052&rtt=auto",
                },
                "points": {
                    0: "Будённовский проспект, 12литА5(Остановка Центральный рынок)",
                    1: "Будённовский проспект, 32(Остановка Большая Садовая улица)",
                    2: "Будённовский проспект, 68А(Остановка Улица Малюгиной)",
                    3: "Площадь Ростовского Стрелкового Полка Народного Ополчения, 2(остановка Улица Ларина / РГУПС)",
                    4: "Улица Вавилова, 46(Остановка Иловайская улица)",
                    5: "Таганрогская улица, 133/1(Остановка Улица Оганова)",
                    6: "Таганрогская улица, 167(остановка Стройгородок)",
                }
            },
        },
        "Центр - Суворовский": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216294%2C39.709865~47.221964%2C39.719056~47.231337%2C39.715399~47.250999%2C39.698376~47.265218%2C39.683096~47.263337%2C39.669973~47.292991%2C39.660988~47.320193%2C39.684308&rtt=auto",
                },
                "points": {
                    0: "Будённовский проспект, 12литА5(Остановка Центральный рынок)",
                    1: "Площадь Советов(Остановка Площадь Советов)",
                    2: "Лермонтовская улица, 159/56 (Остановка Лермонтовская улица)",
                    3: "Площадь Ростовского Стрелкового Полка Народного Ополчения, 2(остановка Улица Ларина / РГУПС)",
                    4: "Улица Вавилова, 46(Остановка Иловайская улица)",
                    5: "Таганрогская улица, 107(остановка Авиамоторный переулок)",
                    6: "Особенная улица, 154(Остановка С/т Вираж)",
                    7: "Улица Петренко, 1/2(Остановка Переулок Белоусова)",
                },
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216294%2C39.709865~47.220640%2C39.707808~47.229819%2C39.703712~47.250999%2C39.698376~47.265218%2C39.683096~47.277367%2C39.686078~47.292991%2C39.660988~47.320193%2C39.684308&rtt=auto",
                },
                "points": {
                    0: "Будённовский проспект, 12литА5(Остановка Центральный рынок)",
                    1: "Будённовский проспект, 32(Остановка Большая Садовая улица)",
                    2: "Будённовский проспект, 68А(Остановка Улица Малюгиной)",
                    3: "Площадь Ростовского Стрелкового Полка Народного Ополчения, 2(остановка Улица Ларина / РГУПС)",
                    4: "Улица Вавилова, 46(Остановка Иловайская улица)",
                    5: "Улица Вавилова, 66(Остановка Изыскательский переулок)",
                    6: "Особенная улица, 154(Остановка С/т Вираж)",
                    7: "Улица Петренко, 1/2(Остановка Переулок Белоусова)",
                },
            },
        },
        "Центр - Северный": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.288774%2C39.710063&rtt=mt",
                },
                "points": {
                    0: "Московская улица, 56 ( ост. Центральный рынок)",
                    1: "Ворошиловский проспект, 36-38 ( ост. Улица Максима Горького)",
                    2: "Проспект Михаила Нагибина, 4 ( ост. ДГТУ)",
                    3: "Проспект Ленина, 52/6с1 ( ост. Площадь Ленина)",
                    4: "Проспект Михаила Нагибина, 32И (ост.ТЦ Горизонт)",
                    5: "Улица Евдокимова, 39Б ( ост. Улица Евдокимова)",
                    6: "Проспект Космонавтов, 14Б ( ост. Бульвар Комарова)",
                },
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.288774%2C39.710063&rtt=auto",
                },
                "points": {
                    0: "Будённовский проспект, 10/5 ( ост. Центральный рынок / Тургеневская улица)",
                    1: "Улица Максима Горького, 111/52 ( ост. Улица Максима Горького)",
                    2: "Улица Текучёва, 133к2 ( ост. Улица Текучёва)",
                    3: "Улица Шеболдаева, 4/4 ( ост. Улица Шеболдаева)",
                    4: "РГУПС ( ост. Улица Ларина / РГУПС)",
                    5: "Улица Погодина, 42/1 ( ост. Симферопольская улица)",
                    6: "Улица Евдокимова, 35/88 ( ост. Бодрая улица)",
                    7: "Улица Добровольского, 14 ( ост. Улица Добровольского)",
                },
            },
        },
        "Центр - Сельмаш": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.249837%2C39.764537&rtt=mt",
                },
                "points": {
                    0: "Большая Садовая улица, 70 (ост.  Переулок Семашко)",
                    1: "Большая Садовая улица, 106/46 ( ост.  Проспект Чехова)",
                    2: "Театральная площадь, 6 ( ост. Театральная площадь)",
                    3: "Площадь Карла Маркса, 22 ( ост. Площадь Карла Маркса)",
                    4: "Проспект Шолохова, 90/65 ( ост.  20-я линия)",
                    5: "Улица 1-й Конной Армии, 10/70 ( ост. Улица 1-й Конной Армии)",
                },
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.249837%2C39.764537&rtt=auto",
                },
                "points": {
                    0: "Будённовский проспект, 10/5 ( ост. Центральный рынок / Тургеневская улица)",
                    1: "Московская улица, 81 ( ост. Московская улица)",
                    2: "Красноармейская улица, 178А ( ост. Ворошиловский проспект)",
                    3: "Кировский проспект, 92/224 ( ост. Кировский проспект)",
                    4: "Проспект Шолохова, 8 ( ост. Площадь Энергетиков)",
                    5: "Проспект Шолохова, 58/80 ( ост. 14-я линия)",
                    6: "Улица 1-й Конной Армии, 10/70 ( ост. Улица 1-й Конной Армии)",
                },
            },
            3: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.249837%2C39.764537&rtt=auto",
                },
                "points": {
                    0: "Будённовский проспект, 10/5 ( ост. Центральный рынок / Тургеневская улица)",
                    1: "Улица Шаумяна, 85( ( ост. Площадь Советов)",
                    2: "Большая Садовая улица, 134/157 ( ост. Кировский проспект)",
                    3: "Театральная площадь, 6 ( ост. Театральная площадь)",
                    4: "Советская улица, 29/1 ( ост.14-я линия)",
                    5: "Проспект Шолохова, 104Ак5 ( ост. Рынок Прогресс)",
                    6: "Улица 1-й Конной Армии, 10/70 ( ост. Улица 1-й Конной Армии)",
                },
            },
        },
        "Центр - Западный": {
            1: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.212218%2C39.634146&rtt=mt",
                },
                "points": {
                    0: "проспект Стачки, 190А ( ост. Улица Зорге)",
                    1: "проспект Стачки, 104А ( ост.  2-я Кольцевая улица)",
                    2: "проспект Стачки, 20 ( ост. Площадь Дружинников)",
                    3: "Московская улица, 7 ( ост. Площадь 5-го Донского корпуса)",
                    4: "Московская улица, 50Б ( ост. Центральный рынок)",
                },
            },
            2: {
                "route_info": {
                    "link": "https://yandex.ru/maps?rtext=47.216824%2C39.712173~47.212218%2C39.634146&rtt=auto",
                },
                "points": {
                    0: "проспект Стачки, 190А ( ост. Улица Зорге)",
                    1: "проспект Стачки, 104А ( ост. 2-я Кольцевая улица)",
                    2: "Профсоюзная улица, 122 ( ост. Проспект Ставского)",
                    3: "Профсоюзная улица, 16 ( ост. Мемориал)",
                    4: "Будённовский проспект, 10/5 ( ост. Центральный рынок / Тургеневская улица)",
                },
            },
        }
    }

    def get_route_by_direction(direction: str, route: int):
        return DirectionRoutesPoints.direction_routes_points[direction][route]["route_info"]

    def get_point_by_direction_and_route(direction: str, route: int, point: int):
        return DirectionRoutesPoints.direction_routes_points[direction][route]["points"][point]

    def get_number_of_routes_by_direction(direction: str):
        return len(DirectionRoutesPoints.direction_routes_points[direction])

    def get_number_of_points_by_direction_and_route(direction: str, route: int):
        return len(DirectionRoutesPoints.direction_routes_points[direction][route]["points"])